<img src="https://raw.githubusercontent.com/afo/data-x-plaksha/master/imgsource/dx_logo.png" align="left"></img><br><br><br><br>

## Plaksha SQL assignment

---

## Submission details:

Please submit this as a Jupyter Notebook and a PDF of your results (both should show output). Also push your solutions to Github.

For the submision create a local database with `sqlite3` or `sqlalchemy` in a Jupyter notebook and make the queries either with a cursor object (and then print the results) or by using pandas `pd.read_sql_query()`.

___

When completing this homework you can experiment with SQL commands by utilizing this great online editor:

https://www.w3schools.com/sql/trysql.asp?filename=trysql_select_all

There are already some tables in the online Database, namely:

`Categories, Employees, OrderDetails, Orders, Products, Shippers, and Suppliers.`

If you want you can drop them by running  `DROP TABLE [table-name];` (or just keep them).

___

## Exercises:

First create a table called students. It has the columns: 'student_id', 'name', 'major', 'gpa' and 'enrollment_date' We will use a new form of `CREATE TABLE` expression to produce this table.

Note that you can improve this and are welcome to do so -- e.g. by specifying for example a PRIMARY KEY and a FOREIGN KEY in Q2 :)

    CREATE TABLE students AS
        SELECT 1 AS student_id, "John" AS name, "Computer Science" AS major, 3.5 AS gpa, "01-01-2022" AS enrollment_date UNION
        SELECT 2, "Jane", "Physics", 3.8, "01-02-2022" UNION
        SELECT 3, "Bob", "Engineering", 3.0, "01-03-2022" UNION
        SELECT 4, "Samantha", "Physics", 3.9, "01-04-2022" UNION
        SELECT 5, "James", "Engineering", 3.7, "01-05-2022" UNION
        SELECT 6, "Emily", "Computer Science", 3.6, "01-06-2022" UNION
        SELECT 7, "Michael", "Computer Science", 3.2, "01-07-2022" UNION
        SELECT 8, "Jessica", "Engineering", 3.8, "01-08-2022" UNION
        SELECT 9, "Jacob", "Physics", 3.4, "01-09-2022" UNION
        SELECT 10, "Ashley", "Physics", 3.9, "01-10-2022";


## Q1 Simple SELECTS (on the students table)
1. SELECT all records in the table.
2. SELECT students whose major is "Computer Science".
3. SELECT all unique majors (use SELECT DISTINCT) and order them by name, descending order (i.e. Physics first).
4. SELECT all students that have an 'e' in their name and order them by gpa in ascending order.


## Q2 Joins

Create a new table called courses, which indicates the courses taken by the students. 

Create the table by running:
	
    CREATE TABLE courses AS
        SELECT 1 AS course_id, "Python programming" AS course_name, 1 AS student_id, "A" AS grade UNION
        SELECT 2, "Data Structures", 2, "B" UNION
        SELECT 3, "Database Systems", 3, "B" UNION
        SELECT 1, "Python programming", 4, "A" UNION
        SELECT 4, "Quantum Mechanics", 5, "C" UNION
        SELECT 1, "Python programming", 6, "F" UNION
        SELECT 2, "Data Structures", 7, "C" UNION
        SELECT 3, "Database Systems", 8, "A" UNION
        SELECT 4, "Quantum Mechanics", 9, "A" UNION
        SELECT 2, "Data Structures", 10, "F";

1. COUNT the number of unique courses.
2. JOIN the tables students and courses and COUNT the number of students with the major Computer Science taking the course Python programming.
3. JOIN the tables students and courses and select the students who have grades higher than "C", only show their name, major, gpa, course_name and grade.


## Q3 Aggregate functions, numerical logic and grouping

1. Find the average gpa of all students.
2. SELECT the student with the maximum gpa, display only their student_id, major and gpa
3. SELECT the student with the minimum gpa, display only their student_id, major and gpa
4. SELECT the students with a gpa greater than 3.6 in the majors of "Physics" and "Engineering", display only their student_id, major and gpa
5. Group the students by their major and retrieve the average grade of each major.
6. SELECT the top 2 students with the highest GPA in each major and order the results by major in ascending order, then by GPA in descending order

# Your solution

###Pre-work

In [1]:
# Importing our database engine
import sqlite3

In [4]:
!ls

sample_data  students.db

In [2]:
# Creating a connection to sqlite3 by creating a new database, students.db
connection = sqlite3.connect('students.db')

In [4]:
# Checking if the database is created
!ls

sample_data  students.db

In [5]:
# Creating a cursor object for the execution of the queries
cursor = connection.cursor()

In [6]:
# Creating the students table and checking if the data is populated correctly
cursor.execute("DROP TABLE IF EXISTS students;")

sql_command = """
CREATE TABLE students AS
    SELECT 1 AS student_id, "John" AS name, "Computer Science" AS major, 3.5 AS gpa, "01-01-2022" AS enrollment_date UNION
    SELECT 2, "Jane", "Physics", 3.8, "01-02-2022" UNION
    SELECT 3, "Bob", "Engineering", 3.0, "01-03-2022" UNION
    SELECT 4, "Samantha", "Physics", 3.9, "01-04-2022" UNION
    SELECT 5, "James", "Engineering", 3.7, "01-05-2022" UNION
    SELECT 6, "Emily", "Computer Science", 3.6, "01-06-2022" UNION
    SELECT 7, "Michael", "Computer Science", 3.2, "01-07-2022" UNION
    SELECT 8, "Jessica", "Engineering", 3.8, "01-08-2022" UNION
    SELECT 9, "Jacob", "Physics", 3.4, "01-09-2022" UNION
    SELECT 10, "Ashley", "Physics", 3.9, "01-10-2022";
"""

cursor.execute(sql_command)

all_student_records=cursor.execute('SELECT * FROM students')

for row in all_student_records.fetchall():
    print(row)

(1, 'John', 'Computer Science', 3.5, '01-01-2022')
(2, 'Jane', 'Physics', 3.8, '01-02-2022')
(3, 'Bob', 'Engineering', 3.0, '01-03-2022')
(4, 'Samantha', 'Physics', 3.9, '01-04-2022')
(5, 'James', 'Engineering', 3.7, '01-05-2022')
(6, 'Emily', 'Computer Science', 3.6, '01-06-2022')
(7, 'Michael', 'Computer Science', 3.2, '01-07-2022')
(8, 'Jessica', 'Engineering', 3.8, '01-08-2022')
(9, 'Jacob', 'Physics', 3.4, '01-09-2022')
(10, 'Ashley', 'Physics', 3.9, '01-10-2022')

In [7]:
# Creating the courses table and checking if the data is populated correctly
cursor.execute("DROP TABLE IF EXISTS courses;")

sql_command = """
CREATE TABLE courses AS
    SELECT 1 AS course_id, "Python programming" AS course_name, 1 AS student_id, "A" AS grade UNION
    SELECT 2, "Data Structures", 2, "B" UNION
    SELECT 3, "Database Systems", 3, "B" UNION
    SELECT 1, "Python programming", 4, "A" UNION
    SELECT 4, "Quantum Mechanics", 5, "C" UNION
    SELECT 1, "Python programming", 6, "F" UNION
    SELECT 2, "Data Structures", 7, "C" UNION
    SELECT 3, "Database Systems", 8, "A" UNION
    SELECT 4, "Quantum Mechanics", 9, "A" UNION
    SELECT 2, "Data Structures", 10, "F";
"""

cursor.execute(sql_command)

all_course_records=cursor.execute('SELECT * FROM courses')

for row in all_course_records.fetchall():
    print(row)

(1, 'Python programming', 1, 'A')
(1, 'Python programming', 4, 'A')
(1, 'Python programming', 6, 'F')
(2, 'Data Structures', 2, 'B')
(2, 'Data Structures', 7, 'C')
(2, 'Data Structures', 10, 'F')
(3, 'Database Systems', 3, 'B')
(3, 'Database Systems', 8, 'A')
(4, 'Quantum Mechanics', 5, 'C')
(4, 'Quantum Mechanics', 9, 'A')

In [19]:
# Viewing the merged view of the tables
merge=cursor.execute("SELECT * FROM students JOIN courses ON students.student_id=courses.student_id;").fetchall()
for i in merge:
  print(i)

(1, 'John', 'Computer Science', 3.5, '01-01-2022', 1, 'Python programming', 1, 'A')
(2, 'Jane', 'Physics', 3.8, '01-02-2022', 2, 'Data Structures', 2, 'B')
(3, 'Bob', 'Engineering', 3.0, '01-03-2022', 3, 'Database Systems', 3, 'B')
(4, 'Samantha', 'Physics', 3.9, '01-04-2022', 1, 'Python programming', 4, 'A')
(5, 'James', 'Engineering', 3.7, '01-05-2022', 4, 'Quantum Mechanics', 5, 'C')
(6, 'Emily', 'Computer Science', 3.6, '01-06-2022', 1, 'Python programming', 6, 'F')
(7, 'Michael', 'Computer Science', 3.2, '01-07-2022', 2, 'Data Structures', 7, 'C')
(8, 'Jessica', 'Engineering', 3.8, '01-08-2022', 3, 'Database Systems', 8, 'A')
(9, 'Jacob', 'Physics', 3.4, '01-09-2022', 4, 'Quantum Mechanics', 9, 'A')
(10, 'Ashley', 'Physics', 3.9, '01-10-2022', 2, 'Data Structures', 10, 'F')

###Q1

In [8]:
# SELECT all records in the table
cursor.execute('SELECT * FROM students').fetchall()

[(1, 'John', 'Computer Science', 3.5, '01-01-2022'),
 (2, 'Jane', 'Physics', 3.8, '01-02-2022'),
 (3, 'Bob', 'Engineering', 3.0, '01-03-2022'),
 (4, 'Samantha', 'Physics', 3.9, '01-04-2022'),
 (5, 'James', 'Engineering', 3.7, '01-05-2022'),
 (6, 'Emily', 'Computer Science', 3.6, '01-06-2022'),
 (7, 'Michael', 'Computer Science', 3.2, '01-07-2022'),
 (8, 'Jessica', 'Engineering', 3.8, '01-08-2022'),
 (9, 'Jacob', 'Physics', 3.4, '01-09-2022'),
 (10, 'Ashley', 'Physics', 3.9, '01-10-2022')]

In [9]:
# SELECT students whose major is "Computer Science"
cursor.execute('SELECT * FROM students WHERE major="Computer Science";').fetchall()

[(1, 'John', 'Computer Science', 3.5, '01-01-2022'),
 (6, 'Emily', 'Computer Science', 3.6, '01-06-2022'),
 (7, 'Michael', 'Computer Science', 3.2, '01-07-2022')]

In [11]:
# SELECT all unique majors (use SELECT DISTINCT) and order them by name, descending order (i.e. Physics first)
unique_courses=cursor.execute('SELECT DISTINCT major FROM students ORDER BY major DESC;')
for i in unique_courses.fetchall():
  print(i[0])

Physics
Engineering
Computer Science

In [12]:
# SELECT all students that have an 'e' in their name and order them by gpa in ascending order
cursor.execute('SELECT * FROM students WHERE name LIKE "%e%" ORDER BY gpa;').fetchall()

[(7, 'Michael', 'Computer Science', 3.2, '01-07-2022'),
 (6, 'Emily', 'Computer Science', 3.6, '01-06-2022'),
 (5, 'James', 'Engineering', 3.7, '01-05-2022'),
 (2, 'Jane', 'Physics', 3.8, '01-02-2022'),
 (8, 'Jessica', 'Engineering', 3.8, '01-08-2022'),
 (10, 'Ashley', 'Physics', 3.9, '01-10-2022')]

###Q2

In [13]:
# COUNT the number of unique courses
cursor.execute('SELECT COUNT(DISTINCT course_name) FROM courses;').fetchone()[0]

4

In [14]:
# JOIN the tables students and courses and COUNT the number of students with the major Computer Science taking the course Python programming
cursor.execute('SELECT COUNT(*) FROM students JOIN courses ON students.student_id=courses.student_id WHERE major="Computer Science" AND course_name="Python programming";').fetchone()[0]

2

In [20]:
# JOIN the tables students and courses and select the students who have grades higher than "C", only show their name, major, gpa, course_name and grade
cursor.execute('SELECT name, major, gpa, course_name, grade FROM students JOIN courses ON students.student_id=courses.student_id WHERE grade<"C";').fetchall()

[('John', 'Computer Science', 3.5, 'Python programming', 'A'),
 ('Samantha', 'Physics', 3.9, 'Python programming', 'A'),
 ('Jane', 'Physics', 3.8, 'Data Structures', 'B'),
 ('Bob', 'Engineering', 3.0, 'Database Systems', 'B'),
 ('Jessica', 'Engineering', 3.8, 'Database Systems', 'A'),
 ('Jacob', 'Physics', 3.4, 'Quantum Mechanics', 'A')]

### Q3

In [21]:
# Find the average gpa of all students
cursor.execute('SELECT AVG(gpa) FROM students;').fetchone()[0]

3.5800000000000005

In [22]:
# SELECT the student with the maximum gpa, display only their student_id, major and gpa
res=cursor.execute('SELECT student_id, major, gpa FROM students WHERE gpa=(SELECT MAX(gpa) FROM students);').fetchall()
for i in res:
  print(i)

(4, 'Physics', 3.9)
(10, 'Physics', 3.9)

In [23]:
# SELECT the student with the minimum gpa, display only their student_id, major and gpa
cursor.execute('SELECT student_id, major, gpa FROM students WHERE gpa=(SELECT MIN(gpa) FROM students);').fetchall()

[(3, 'Engineering', 3.0)]

In [24]:
# SELECT the students with a gpa greater than 3.6 in the majors of "Physics" and "Engineering", display only their student_id, major and gpa
cursor.execute('SELECT student_id, major, gpa FROM students WHERE gpa>3.6 AND major IN ("Physics","Engineering");').fetchall()

[(2, 'Physics', 3.8),
 (4, 'Physics', 3.9),
 (5, 'Engineering', 3.7),
 (8, 'Engineering', 3.8),
 (10, 'Physics', 3.9)]

In [27]:
# Group the students by their major and retrieve the average grade of each major
res=cursor.execute('SELECT major, AVG(gpa) FROM students GROUP BY major;').fetchall() 
for i in res:
  print(i)

('Computer Science', 3.4333333333333336)
('Engineering', 3.5)
('Physics', 3.75)

In [28]:
# SELECT the top 2 students with the highest GPA in each major and order the results by major in ascending order, then by GPA in descending order
cursor.execute('SELECT * FROM (SELECT * FROM students WHERE major="Computer Science" ORDER BY gpa DESC LIMIT 2)\
 UNION\
 SELECT * FROM (SELECT * FROM students WHERE major="Physics" ORDER BY gpa DESC LIMIT 2)\
 UNION\
 SELECT * FROM (SELECT * FROM students WHERE major="Engineering" ORDER BY gpa DESC LIMIT 2)\
 ORDER BY major ASC, gpa DESC;').fetchall()

[(6, 'Emily', 'Computer Science', 3.6, '01-06-2022'),
 (1, 'John', 'Computer Science', 3.5, '01-01-2022'),
 (8, 'Jessica', 'Engineering', 3.8, '01-08-2022'),
 (5, 'James', 'Engineering', 3.7, '01-05-2022'),
 (4, 'Samantha', 'Physics', 3.9, '01-04-2022'),
 (10, 'Ashley', 'Physics', 3.9, '01-10-2022')]

In [29]:
# Commiting the changes and closing the connection to the database
connection.commit() 

connection.close()